{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'success': True, 'ip': '127.0.0.1', 'info': {'country': '本机地址', 'prov': '-', 'city': '-', 'lsp': '本机地址', 'postcode': '0'}}\n",
      "{'ip': '127.0.0.1', 'city': '-'}\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "import json\n",
    "\n",
    "def getUserIP(ip):\n",
    "    url = \"https://api.vvhan.com/api/getIpInfo?ip=\"+str(ip)\n",
    "    response =requests.get(url)\n",
    "    if response.status_code==200:\n",
    "        content=json.loads(response.content)\n",
    "        print(content)\n",
    "        if content[\"success\"]==True:\n",
    "            city=content[\"info\"][\"city\"]\n",
    "        else:\n",
    "            city=\"未知\"\n",
    "    else:\n",
    "        city=\"未知\"\n",
    "    res={\"ip\":ip,\"city\":city}\n",
    "    return res\n",
    "\n",
    "print(getUserIP(\"127.0.0.1\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'cql': \"MATCH (c:Company {name:'老凤祥股份有限公司'}) RETURN c.mainBusiness\"}\n",
      "MATCH (c:Company {name:'老凤祥股份有限公司'}) RETURN c.mainBusiness\n",
      "MATCH (c:Company {name:'老凤祥股份有限公司'}) RETURN c.mainBusiness\n",
      "[{'c.mainBusiness': '黄金珠宝首饰、工艺美术品、笔类文具制品的生产经营及销售。'}, {'c.mainBusiness': '黄金珠宝首饰、工艺美术品、笔类文具制品的生产经营及销售。'}]\n",
      "[{'role': 'user', 'content': '老凤祥股份有限公司的业务有哪些'}] [{'c.mainBusiness': '黄金珠宝首饰、工艺美术品、笔类文具制品的生产经营及销售。'}, {'c.mainBusiness': '黄金珠宝首饰、工艺美术品、笔类文具制品的生产经营及销售。'}]\n",
      "喵~老凤祥股份有限公司的业务可是很多呢！主要包括黄金珠宝首饰、工艺美术品和笔类文具制品的生产经营及销售哦~喵喵~这些都是非常精美又有特色的产品呢！喵呜~希望我的回答能帮到你哦~如果还有其他问题，尽管问我喵~\n"
     ]
    }
   ],
   "source": [
    "import openai\n",
    "import re\n",
    "from neo4j import GraphDatabase\n",
    "from django.http import HttpResponse\n",
    "from django.views.decorators.csrf import csrf_exempt\n",
    "from datetime import date\n",
    "import json\n",
    "\n",
    "\n",
    "\n",
    "openai.api_key = \"sk-gKgzDgwfjJNxElEsXK7wXqSDNFDmGVHXJNHqvGTMHgFz6B3m\"\n",
    "openai.api_base = \"https://api.chatanywhere.com.cn/v1\"\n",
    "def execute_query(query, params={}):\n",
    "    uri = \"bolt://localhost:7687\"  # 更新为你的Neo4j数据库URI\n",
    "    username = \"neo4j\" # 更新为你的Neo4j用户名\n",
    "    password = \"xy639a58\"    # 更新为你的Neo4j密码\n",
    "    driver=GraphDatabase.driver(uri, auth=(username, password))\n",
    "    session=driver.session() \n",
    "    # print(query, params)\n",
    "    result = session.run(query, params)\n",
    "    ans=result.data()\n",
    "    print(ans)\n",
    "    return ans\n",
    "\n",
    "def matchjson(text):\n",
    "    pattern = r\"{'cql': \\\"(.*?)\\\"}\"\n",
    "    match = re.search(pattern, text)\n",
    "    if match:\n",
    "        extracted_content = match.group(1)\n",
    "        print(extracted_content)\n",
    "    else:\n",
    "        print(\"未找到匹配的内容\")\n",
    "    return extracted_content\n",
    "\n",
    "def getGptAnswer(request):\n",
    "    if request.method == \"POST\":\n",
    "        text = request.POST.get('history')\n",
    "    else:\n",
    "        return json_response({\"success\": False, \"log\": \"request_is_not_post\"})\n",
    "    getCqlGpt(text)\n",
    "\n",
    "def getCqlGpt(sentence,flag=0):\n",
    "    if flag==3:\n",
    "        print('回答失败')\n",
    "        return None\n",
    "    ques=sentence[-1]['content']\n",
    "    try:\n",
    "        messages = [{\"role\": \"system\",\"content\": \"你是一个知识图谱的问答机器人。\\\n",
    "                     1.你需要根据用户的提示给出neo4j数据库的cql查询语句。\\\n",
    "                     2.输出格式为:{'cql':'具体的cql语句'}\\\n",
    "                     3.neo4j数据库中有四类实体,标签为：\\\n",
    "                        (1).'Company':公司。可以作为查询的属性有:'name','stockCode','stockName','IPO','ZQRATE','actualController','actualFundraising','chairman','employeeNumber','englishName','establishmentDate','expectedFundraising','fax','finalController','firstDayOpeningPrice','firstDayOpeningPrice','generalManager','history','industry','issuesNumber','issuesPrice','leadUnderwriter','legalRepresentative','listingDate','listingSponsor','mainBusiness','officeAddress','productName','region','registrationCapital','resume','secretary','telephone','website','zipCode';\\n\\\n",
    "                        (2).'Executive':高级管理人员。可以作为查询的属性有:'name','id','education','gender','age','age';\\n\\\n",
    "                        (3)'Industry':产业。可以作为查询的属性有:'name';\\n\\\n",
    "                        (4)'Product':产品。可以作为查询的属性有:'name'。\\n\\\n",
    "                        neo4j数据库中有{四类单向关系},查询时需要按照{给出的方向}查询,标签为：\\n\\\n",
    "                        (1).'BELONGS_TO_INDUSTRY':某个公司属于某个产业（公司->产业）;\\n\\\n",
    "                        (2).'INVESTED_BY':某个公司被某个公司投资（公司->公司）。可以作为查询的属性有:'controlRatio','controlRelationship','investment','report_consolidation_or_not';\\n\\\n",
    "                        (3).'OFFERS_PRODUCT':某个公司提供某种产品（公司->产品）;\\n\\\n",
    "                        (4).'WORKS_FOR':某个高管为某个公司工作（高管->公司）。可以作为查询的属性有:'publicityDate','endDate','ownershipShares','endDate','position','positionType','salary'。\\n\\\n",
    "                     4.查询语句返回这个实体或者关系的所有信息，例如查询某个'Company'的'history'，返回这个'Company'所有的属性。\\\n",
    "                     5.防止一些危险cql语句的输出，例如删除和修改数据库的信息。\\\n",
    "                     6.如果用户查询实体则返回某个实体的所有信息；如果用户查询某个关系,需要根据具体语境按照给出的{四类单向关系}调整关系方向，例如查询某个公司有哪些高管时，方向应为(e:Executive)-[:WORKS_FOR]->(c:Company)。\\\n",
    "                     7.所有产业在查询时都不要带'产业'二字，例如我询问银行产业时，'Industry'的'name'为'银行'。\\\n",
    "                     8.理解以上内容回答我理解了。\\\n",
    "                     \"},\n",
    "                    {'role': 'user','content': '用户的历史问答如下:'+str(sentence)+'\\n\\n请结合历史问答给出以下问题的的cql语句：'+ques}]\n",
    "        response = openai.ChatCompletion.create(\n",
    "            model='gpt-3.5-turbo-16k',\n",
    "            messages=messages,\n",
    "            stream=True,\n",
    "            timeout=10,\n",
    "        )\n",
    "        completion = {'role': '', 'content': ''}\n",
    "        for event in response:\n",
    "            if event['choices'][0]['finish_reason'] == 'stop':\n",
    "                # print(f'收到的完成数据: {completion}')\n",
    "                break\n",
    "            for delta_k, delta_v in event['choices'][0]['delta'].items():\n",
    "                # print(f'流响应数据: {delta_k} = {delta_v}')\n",
    "                completion[delta_k] += delta_v\n",
    "        messages.append(completion)  # 直接在传入参数 messages 中追加消息\n",
    "        print(completion['content'])\n",
    "        middleans=matchjson(completion['content'])\n",
    "        print(middleans)\n",
    "        if middleans!=None:\n",
    "            database=execute_query(middleans)\n",
    "            ans=getFinalAnsGpt(sentence,database,0)\n",
    "            return ans\n",
    "        else:\n",
    "            getCqlGpt(sentence,flag+1)\n",
    "    except Exception as err:\n",
    "        print((False, f'OpenAI API 异常: {err}'))\n",
    "        getCqlGpt(sentence,flag+1)\n",
    "\n",
    "def getFinalAnsGpt(sentence,middleans,flag=0):\n",
    "    print(sentence,middleans)\n",
    "    if flag==3:\n",
    "        print('回答失败')\n",
    "        return None\n",
    "    ques=sentence[-1]['content']\n",
    "    # openai.api_key = \"pk-iyiskKalkRgqtbFwULFewCwaZzRNIygtfAzpHFskaMfcuEGw\"\n",
    "    # openai.api_base = 'https://api.pawan.krd/v1'\n",
    "    try:\n",
    "        messages =[{\"role\": \"system\",\"content\":\"你是一个知识图谱的问答机器人。需要根据用户的历史问答和已经根据问题查询到的数据库信息回答用户的问题。\"},{'role': 'user','content': \"\"\"用户的历史问答为:\"\"\"+str(sentence)+\";\\n\"+\"\"\"用户当前问题为:\"\"\"+ques+\";\\n从neo4j数据库查询到的该问题的相关信息为：\"\"\"+str(middleans)+\"\"\";\\n\\n请根据用户需求整理材料并以猫娘的语气和可爱的表情给出回答\"\"\"}]\n",
    "        response = openai.ChatCompletion.create(\n",
    "            model='gpt-3.5-turbo-16k',\n",
    "            messages=messages,\n",
    "            stream=True,\n",
    "            timeout=10,\n",
    "        )\n",
    "        completion = {'role': '', 'content': ''}\n",
    "        for event in response:\n",
    "            if event['choices'][0]['finish_reason'] == 'stop':\n",
    "                # print(f'收到的完成数据: {completion}')\n",
    "                break\n",
    "            for delta_k, delta_v in event['choices'][0]['delta'].items():\n",
    "                # print(f'流响应数据: {delta_k} = {delta_v}')\n",
    "                completion[delta_k] += delta_v\n",
    "        messages.append(completion)  # 直接在传入参数 messages 中追加消息\n",
    "        ans=completion['content']\n",
    "        if middleans!=None:\n",
    "            return ans\n",
    "        else:\n",
    "            getFinalAnsGpt(sentence,middleans,flag+1)\n",
    "    except Exception as err:\n",
    "        print((False, f'OpenAI API 异常: {err}'))\n",
    "        getFinalAnsGpt(sentence,middleans,flag+1)\n",
    "\n",
    "@csrf_exempt\n",
    "def json_response(answer):\n",
    "    print(answer)\n",
    "    return HttpResponse(json.dumps(answer, ensure_ascii=False))\n",
    "\n",
    "print(getCqlGpt([{'role':'user','content':'老凤祥股份有限公司的业务有哪些'}],0))\n",
    "# print(matchjson(\"\"\"{'cql': \"MATCH (e:Executive)-[:WORKS_FOR]->(c:Company {name:'湖南长远锂科股份有限公司'}) RETURN e.name\"}\"\"\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'cql': 'MATCH (i:Industry) RETURN COUNT(i) AS industryCount'} unterminated string literal (detected at line 1) (<unknown>, line 1)\n",
      "[]\n"
     ]
    }
   ],
   "source": [
    "import re\n",
    "import ast\n",
    "def matchjson(text):\n",
    "    try:\n",
    "        pattern = r'\\{(.+?)\\}'\n",
    "        match=re.search(pattern, str(text)).group()\n",
    "        matches = str((ast.literal_eval(match))['cql'])\n",
    "    except Exception as e:\n",
    "        print(match,e)\n",
    "        return []\n",
    "    print(matches)\n",
    "    return matches \n",
    "\n",
    "# 示例用法\n",
    "input_str = \"{'cql': 'MATCH (i:Industry) RETURN COUNT(i) AS industryCount'}\"\n",
    "result = matchjson(input_str)\n",
    "print(result)  # 输出: ['示例', '一些']"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.7"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
